In [1]:
import pandas as pd
import numpy as np

In [2]:
#creating a series
a=np.array(['a','b','c','d'])
print(a)

['a' 'b' 'c' 'd']

In [4]:
s=pd.Series(a)

In [5]:
s

0    a
1    b
2    c
3    d
dtype: object

In [10]:
s=pd.Series(a,index=[10,20,30,40])

In [11]:
s

10    a
20    b
30    c
40    d
dtype: object

In [12]:
#creating series from dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [13]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [14]:
c=pd.Series(d)

In [15]:
c

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
c['b']

2

In [17]:
type(c)

pandas.core.series.Series

In [18]:
b=pd.Series(d,index=['d','e','f','g'])

In [19]:
b

d    4.0
e    NaN
f    NaN
g    NaN
dtype: float64

In [25]:
#datafrrame
stu={'name':['bigyajeet','binod','biswojeet'],
     'roll':[10,20,30],
     'course':['AIML','Python','Java']}
stu

{'name': ['bigyajeet', 'binod', 'biswojeet'],
 'roll': [10, 20, 30],
 'course': ['AIML', 'Python', 'Java']}

In [28]:
df=pd.DataFrame(stu)

In [29]:
df

        name  roll  course
0  bigyajeet    10    AIML
1      binod    20  Python
2  biswojeet    30    Java

In [30]:
df.head(2)

        name  roll  course
0  bigyajeet    10    AIML
1      binod    20  Python

In [32]:
df.tail()

        name  roll  course
0  bigyajeet    10    AIML
1      binod    20  Python
2  biswojeet    30    Java

In [33]:
#rename
d=df.rename(columns={'name':'family_name'})

In [34]:
d

  family_name  roll  course
0   bigyajeet    10    AIML
1       binod    20  Python
2   biswojeet    30    Java

In [37]:
b=pd.DataFrame({
    'days':[1,2,np.NaN,4,5],
    'Places':['puri','maldives','manali','los angles','moscow'],
    'visitors':[0000,8000,9000,10000,6700],
})
b

   days      Places  visitors
0   1.0        puri         0
1   2.0    maldives      8000
2   NaN      manali      9000
3   4.0  los angles     10000
4   5.0      moscow      6700

In [38]:
#to check missing value
b.isnull().sum()

days        1
Places      0
visitors    0
dtype: int64

In [39]:
b.isnull()

    days  Places  visitors
0  False   False     False
1  False   False     False
2   True   False     False
3  False   False     False
4  False   False     False

In [41]:
b["days"].fillna(3,inplace=True)

In [42]:
b

   days      Places  visitors
0   1.0        puri         0
1   2.0    maldives      8000
2   3.0      manali      9000
3   4.0  los angles     10000
4   5.0      moscow      6700